nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/glcd/processor/glcd_p32mz2025dab169.h
PLIB_INLINE_API bool PLIB_GLCD_ExistsFrontPorchXY(GLCD_MODULE_ID index)
{
     return GLCD_ExistsFrontPorchXY_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_FrontPorchXYSet(GLCD_MODULE_ID index, uint32_t frontPorchX, uint32_t frontPorchY)
{
     GLCD_FrontPorchXYSet_Default(index, frontPorchX, frontPorchY);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_FrontPorchXGet(GLCD_MODULE_ID index)
{
     return GLCD_FrontPorchXGet_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_FrontPorchYGet(GLCD_MODULE_ID index)
{
     return GLCD_FrontPorchYGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsBlankingXY(GLCD_MODULE_ID index)
{
     return GLCD_ExistsBlankingXY_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_BlankingXYSet(GLCD_MODULE_ID index, uint32_t blankingX, uint32_t blankingY)
{
     GLCD_BlankingXYSet_Default(index, blankingX, blankingY);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_BlankingXGet(GLCD_MODULE_ID index)
{
     return GLCD_BlankingXGet_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_BlankingYGet(GLCD_MODULE_ID index)
{
     return GLCD_BlankingYGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsBackPorchXY(GLCD_MODULE_ID index)
{
     return GLCD_ExistsBackPorchXY_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_BackPorchXYSet(GLCD_MODULE_ID index, uint32_t backPorchX, uint32_t backPorchY)
{
     GLCD_BackPorchXYSet_Default(index, backPorchX, backPorchY);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_BackPorchXGet(GLCD_MODULE_ID index)
{
     return GLCD_BackPorchXGet_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_BackPorchYGet(GLCD_MODULE_ID index)
{
     return GLCD_BackPorchYGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsCursorXY(GLCD_MODULE_ID index)
{
     return GLCD_ExistsCursorXY_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_CursorXYSet(GLCD_MODULE_ID index, uint32_t cursorX, uint32_t cursorY)
{
     GLCD_CursorXYSet_Default(index, cursorX, cursorY);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_CursorXGet(GLCD_MODULE_ID index)
{
     return GLCD_CursorXGet_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_GLCD_CursorYGet(GLCD_MODULE_ID index)
{
     return GLCD_CursorYGet_Default(index);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerColorMode(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerColorMode_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerColorModeSet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId, GLCD_LAYER_COLOR_MODE colorMode)
{
     GLCD_LayerColorModeSet_Default(index, layerId, colorMode);
}

PLIB_INLINE_API GLCD_LAYER_COLOR_MODE PLIB_GLCD_LayerColorModeGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerColorModeGet_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerSrcBlendFunc(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerSrcBlendFunc_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerSrcBlendFuncSet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId, GLCD_LAYER_SRC_BLEND_FUNC blendFunc)
{
     GLCD_LayerSrcBlendFuncSet_Default(index, layerId, blendFunc);
}

PLIB_INLINE_API GLCD_LAYER_SRC_BLEND_FUNC PLIB_GLCD_LayerSrcBlendFuncGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerSrcBlendFuncGet_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerDestBlendFunc(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerDestBlendFunc_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerDestBlendFuncSet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId, GLCD_LAYER_DEST_BLEND_FUNC blendFunc)
{
     GLCD_LayerDestBlendFuncSet_Default(index, layerId, blendFunc);
}

PLIB_INLINE_API GLCD_LAYER_DEST_BLEND_FUNC PLIB_GLCD_LayerDestBlendFuncGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerDestBlendFuncGet_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerGlobalAlpha(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerGlobalAlpha_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerGlobalAlphaSet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId, uint8_t value)
{
     GLCD_LayerGlobalAlphaSet_Default(index, layerId, value);
}

PLIB_INLINE_API uint8_t PLIB_GLCD_LayerGlobalAlphaGet(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerGlobalAlphaGet_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerPreMultiplyImageAlpha(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerPreMultiplyImageAlpha_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerPreMultiplyImageAlphaEnable(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     GLCD_LayerPreMultiplyImageAlphaEnable_Default(index, layerId);
}

PLIB_INLINE_API void PLIB_GLCD_LayerPreMultiplyImageAlphaDisable(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     GLCD_LayerPreMultiplyImageAlphaDisable_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_LayerPreMultiplyImageAlphaIsEnabled(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerPreMultiplyImageAlphaIsEnabled_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerForceWithGlobalAlpha(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerForceWithGlobalAlpha_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerForceWithGlobalAlphaEnable(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     GLCD_LayerForceWithGlobalAlphaEnable_Default(index, layerId);
}

PLIB_INLINE_API void PLIB_GLCD_LayerForceWithGlobalAlphaDisable(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     GLCD_LayerForceWithGlobalAlphaDisable_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_LayerForceWithGlobalAlphaIsEnabled(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     return GLCD_LayerForceWithGlobalAlphaIsEnabled_Default(index, layerId);
}

PLIB_INLINE_API bool PLIB_GLCD_ExistsLayerBilinearFilterEnable(GLCD_MODULE_ID index)
{
     return GLCD_ExistsLayerBilinearFilterEnable_Default(index);
}

PLIB_INLINE_API void PLIB_GLCD_LayerBilinearFilterEnable(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     GLCD_LayerBilinearFilterEnable_Default(index, layerId);
}

PLIB_INLINE_API void PLIB_GLCD_LayerBilinearFilterDisable(GLCD_MODULE_ID index, GLCD_LAYER_ID layerId)
{
     GLCD_LayerBilinearFilterDisable_Default(index, layerId);
}

